package ru.itis.task2.repositories

import ru.itis.task2.dataClasses.Country

object CountryRepository {
    val countries: List<Country> = listOf(
        Country(0, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(1, "USA", "Washington",
            "https://otvet.imgsmail.ru/download/263997461_b269619def69f5ee415e18dd296a77ad.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(2, "Germany", "Berlin",
            "https://crimeabusiness.ru/wp-content/uploads/2017/07/Germaniya1.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(3, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(4, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(5, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(6, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
        Country(7, "Russia", "Moscow",
            "https://wdorogu.ru/wp-content/uploads/2023/05/screenshot_26-kopiya-kopiya.jpg",
            "Росси́я, или Росси́йская Федера́ция (сокр. РФ]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в международно признанных границах составляет 17 098 246 км²."),
    )
}